
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>线程原理 · 知识小集</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="zhoumin">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="iOS多线程开发－多线程实现方式.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://github.com/z251257144" target="_blank" class="custom-link">GitHub主页</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    InterView
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../InterView/Foundation.html">
            
                <a href="../InterView/Foundation.html">
            
                    
                    Foundation
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    多线程开发
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.3.1" data-path="iOS多线程开发－线程原理.html">
            
                <a href="iOS多线程开发－线程原理.html">
            
                    
                    线程原理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="iOS多线程开发－多线程实现方式.html">
            
                <a href="iOS多线程开发－多线程实现方式.html">
            
                    
                    多线程实现方式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="iOS多线程开发－线程安全.html">
            
                <a href="iOS多线程开发－线程安全.html">
            
                    
                    线程安全
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="iOS多线程开发－RunLoop.html">
            
                <a href="iOS多线程开发－RunLoop.html">
            
                    
                    RunLoop
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    UI
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../UI/UIView_CALayer.html">
            
                <a href="../UI/UIView_CALayer.html">
            
                    
                    UIView & CALayer 关系
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >线程原理</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x7B80;&#x4ECB;">&#x7B80;&#x4ECB;</h2>
<p>&#x5728;&#x4F20;&#x7EDF;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x8FDB;&#x7A0B;&#x62E5;&#x6709;&#x72EC;&#x7ACB;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x548C;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x63A7;&#x5236;&#x7684;&#x7EBF;&#x7A0B;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x73B0;&#x5728;&#x7684;&#x60C5;&#x51B5;&#x66F4;&#x591A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x8981;&#x6C42;&#x5728;&#x540C;&#x4E00;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x4E0B;&#x62E5;&#x6709;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x3002;&#x56E0;&#x6B64;&#x7EBF;&#x7A0B;&#x88AB;&#x5F15;&#x5165;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;</p>
<h2 id="&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x7EBF;&#x7A0B;">&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x7EBF;&#x7A0B;?</h2>
<p>   &#x5982;&#x679C;&#x975E;&#x8981;&#x8BF4;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x7EBF;&#x7A0B;&#xFF0C;&#x8FD8;&#x4E0D;&#x5982;&#x8BF4;&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x8FDB;&#x7A0B;&#x4E2D;&#x8FD8;&#x6709;&#x5176;&#x5B83;&#x8FDB;&#x7A0B;&#x3002;&#x8FD9;&#x4E9B;&#x8FDB;&#x7A0B;&#x4E2D;&#x5305;&#x542B;&#x7684;&#x5176;&#x5B83;&#x8FF7;&#x4F60;&#x8FDB;&#x7A0B;&#x5C31;&#x662F;&#x7EBF;&#x7A0B;&#x3002;</p>
<p>&#x7EBF;&#x7A0B;&#x4E4B;&#x6240;&#x4EE5;&#x8BF4;&#x662F;&#x8FF7;&#x4F60;&#x8FDB;&#x7A0B;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x7EBF;&#x7A0B;&#x548C;&#x8FDB;&#x7A0B;&#x6709;&#x5F88;&#x591A;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#xFF0C;&#x6BD4;&#x5982;&#x7EBF;&#x7A0B;&#x548C;&#x8FDB;&#x7A0B;&#x7684;&#x72B6;&#x6001;&#x90FD;&#x6709;&#x8FD0;&#x884C;&#xFF0C;&#x5C31;&#x7EEA;&#xFF0C;&#x963B;&#x585E;&#x72B6;&#x6001;&#x3002;&#x8FD9;&#x51E0;&#x79CD;&#x72B6;&#x6001;&#x7406;&#x89E3;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x5F53;&#x8FDB;&#x7A0B;&#x6240;&#x9700;&#x7684;&#x8D44;&#x6E90;&#x6CA1;&#x6709;&#x5230;&#x4F4D;&#x65F6;&#x4F1A;&#x662F;&#x963B;&#x585E;&#x72B6;&#x6001;&#xFF0C;&#x5F53;&#x8FDB;&#x7A0B;&#x6240;&#x9700;&#x7684;&#x8D44;&#x6E90;&#x5230;&#x4F4D;&#x65F6;&#x4F46;CPU&#x6CA1;&#x6709;&#x5230;&#x4F4D;&#x65F6;&#x662F;&#x5C31;&#x7EEA;&#x72B6;&#x6001;&#xFF0C;&#x5F53;&#x8FDB;&#x7A0B;&#x65E2;&#x6709;&#x6240;&#x9700;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x53C8;&#x6709;CPU&#x65F6;&#xFF0C;&#x5C31;&#x4E3A;&#x8FD0;&#x884C;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;
&#x5C31;&#x62FF;&#x6211;&#x5199;&#x535A;&#x5BA2;&#x6765;&#x8BF4;&#xFF0C;&#x535A;&#x5BA2;&#x9700;&#x8981;&#x76D1;&#x542C;&#x6211;&#x6253;&#x5B57;&#x8F93;&#x5165;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x6BCF;&#x9694;5&#x5206;&#x949F;&#x5BF9;&#x8349;&#x7A3F;&#x8FDB;&#x884C;&#x81EA;&#x52A8;&#x4FDD;&#x5B58;&#x3002;&#x5047;&#x8BBE;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x8FDB;&#x7A0B;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x5F53;&#x5BF9;&#x8349;&#x7A3F;&#x8FDB;&#x884C;&#x4FDD;&#x5B58;&#x65F6;&#xFF0C;&#x56E0;&#x4E3A;&#x6B64;&#x65F6;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x786C;&#x76D8;&#xFF0C;&#x800C;&#x8BBF;&#x95EE;&#x786C;&#x76D8;&#x7684;&#x65F6;&#x95F4;&#x7EBF;&#x7A0B;&#x662F;&#x963B;&#x585E;&#x72B6;&#x6001;&#x7684;&#xFF0C;&#x8FD9;&#x65F6;&#x6211;&#x7684;&#x4EFB;&#x4F55;&#x8F93;&#x5165;&#x90FD;&#x4F1A;&#x6CA1;&#x6709;&#x54CD;&#x5E94;&#xFF0C;&#x8FD9;&#x79CD;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x662F;&#x65E0;&#x6CD5;&#x63A5;&#x53D7;&#x7684;&#xFF0C;&#x6216;&#x8BB8;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x952E;&#x76D8;&#x6216;&#x8005;&#x9F20;&#x6807;&#x7684;&#x8F93;&#x5165;&#x53BB;&#x4E2D;&#x65AD;&#x4FDD;&#x5B58;&#x8349;&#x7A3F;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x4F46;&#x8FD9;&#x79CD;&#x65B9;&#x6848;&#x4E5F;&#x5E76;&#x4E0D;&#x8BA8;&#x597D;&#x3002;&#x800C;&#x4F7F;&#x7528;&#x591A;&#x7EBF;&#x7A0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x4EC5;&#x4EC5;&#x9700;&#x8981;&#x5904;&#x7406;&#x81EA;&#x5DF1;&#x90A3;&#x4E00;&#x90E8;&#x5206;&#x5E94;&#x8BE5;&#x5B8C;&#x6210;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x800C;&#x4E0D;&#x7528;&#x53BB;&#x5173;&#x5FC3;&#x548C;&#x5176;&#x5B83;&#x7EBF;&#x7A0B;&#x7684;&#x51B2;&#x7A81;&#x3002;&#x56E0;&#x6B64;&#x7B80;&#x5316;&#x4E86;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#x3002;&#x5982;&#x56FE;1&#x6240;&#x793A;&#x3002;</p>
<p><img src="image/1.png" alt="img"></p>
<p>&#x66F4;&#x5177;&#x4F53;&#x7684;&#x8BF4;&#xFF0C;&#x7EBF;&#x7A0B;&#x7684;&#x597D;&#x5904;&#x5982;&#x4E0B;:</p>
<ul>
<li>1.&#x5728;&#x5F88;&#x591A;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x9700;&#x8981;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E92;&#x76F8;&#x540C;&#x6B65;&#x6216;&#x4E92;&#x65A5;&#x7684;&#x5E76;&#x884C;&#x5B8C;&#x6210;&#x5DE5;&#x4F5C;&#xFF0C;&#x800C;&#x5C06;&#x8FD9;&#x4E9B;&#x5DE5;&#x4F5C;&#x5206;&#x89E3;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x7EBF;&#x7A0B;&#x4E2D;&#x53BB;&#x65E0;&#x7591;&#x7B80;&#x5316;&#x4E86;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#x3002;</li>
<li>2.&#x56E0;&#x4E3A;&#x7EBF;&#x7A0B;&#x76F8;&#x6BD4;&#x8FDB;&#x7A0B;&#x6765;&#x8BF4;&#xFF0C;&#x66F4;&#x52A0;&#x7684;&#x8F7B;&#x91CF;&#xFF0C;&#x6240;&#x4EE5;&#x7EBF;&#x7A0B;&#x7684;&#x521B;&#x5EFA;&#x548C;&#x9500;&#x6BC1;&#x7684;&#x4EE3;&#x4EF7;&#x53D8;&#x5F97;&#x66F4;&#x5C0F;&#x3002;</li>
<li>3.&#x7EBF;&#x7A0B;&#x63D0;&#x9AD8;&#x4E86;&#x6027;&#x80FD;&#xFF0C;&#x867D;&#x7136;&#x7EBF;&#x7A0B;&#x5B8F;&#x89C2;&#x4E0A;&#x662F;&#x5E76;&#x884C;&#x7684;&#xFF0C;&#x4F46;&#x5FAE;&#x89C2;&#x4E0A;&#x5374;&#x662F;&#x4E32;&#x884C;&#x3002;&#x4ECE;CPU&#x89D2;&#x5EA6;&#x7EBF;&#x7A0B;&#x5E76;&#x65E0;&#x6CD5;&#x63D0;&#x5347;&#x6027;&#x80FD;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x67D0;&#x4E9B;&#x7EBF;&#x7A0B;&#x6D89;&#x53CA;&#x5230;&#x7B49;&#x5F85;&#x8D44;&#x6E90;&#xFF08;&#x6BD4;&#x5982;IO&#xFF0C;&#x7B49;&#x5F85;&#x8F93;&#x5165;&#xFF09;&#x65F6;&#xFF0C;&#x591A;&#x7EBF;&#x7A0B;&#x5141;&#x8BB8;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x5176;&#x5B83;&#x7EBF;&#x7A0B;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x800C;&#x4E0D;&#x662F;&#x6574;&#x4E2A;&#x8FDB;&#x7A0B;&#x88AB;&#x963B;&#x585E;&#xFF0C;&#x56E0;&#x6B64;&#x63D0;&#x9AD8;&#x4E86;CPU&#x7684;&#x5229;&#x7528;&#x7387;&#xFF0C;&#x4ECE;&#x8FD9;&#x4E2A;&#x89D2;&#x5EA6;&#x4F1A;&#x63D0;&#x5347;&#x6027;&#x80FD;&#x3002;</li>
<li><p>4.&#x5728;&#x591A;CPU&#x6216;&#x591A;&#x6838;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F7F;&#x7528;&#x7EBF;&#x7A0B;&#x4E0D;&#x4EC5;&#x4EC5;&#x5728;&#x5B8F;&#x89C2;&#x4E0A;&#x5E76;&#x884C;&#xFF0C;&#x5728;&#x5FAE;&#x89C2;&#x4E0A;&#x4E5F;&#x662F;&#x5E76;&#x884C;&#x7684;&#x3002;</p>
<p>  &#x8FD9;&#x91CC;&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x4E0A;&#x9762;&#x7684;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x5982;&#x679C;&#x6539;&#x6210;&#x4E24;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF0C;&#x90A3;&#x4E48;&#x8FBE;&#x4E0D;&#x5230;&#x6240;&#x8981;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x56E0;&#x4E3A;&#x8FDB;&#x7A0B;&#x6709;&#x81EA;&#x5DF1;&#x72EC;&#x7ACB;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF0C;&#x800C;&#x7EBF;&#x7A0B;&#x5171;&#x4EAB;&#x8FDB;&#x7A0B;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x3002;</p>
</li>
</ul>
<h2 id="&#x7ECF;&#x5178;&#x7EBF;&#x7A0B;&#x6A21;&#x578B;">&#x7ECF;&#x5178;&#x7EBF;&#x7A0B;&#x6A21;&#x578B;</h2>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x770B;&#x8FDB;&#x7A0B;&#x548C;&#x7EBF;&#x7A0B;&#x7684;&#x89D2;&#x5EA6;&#x662F;&#x8FDB;&#x7A0B;&#x6A21;&#x578B;&#x57FA;&#x4E8E;&#x4E24;&#x7C7B;&#x4E0D;&#x540C;&#x7684;&#x6982;&#x5FF5;&#xFF1A;&#x8D44;&#x6E90;&#x7684;&#x7EC4;&#x7EC7;&#x548C;&#x6267;&#x884C;&#x3002;&#x5728;&#x8FC7;&#x53BB;&#x6CA1;&#x6709;&#x7EBF;&#x7A0B;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x8D44;&#x6E90;&#x7684;&#x7EC4;&#x7EC7;&#x548C;&#x6267;&#x884C;&#x90FD;&#x662F;&#x7531;&#x8FDB;&#x7A0B;&#x5B8C;&#x6210;&#x7684;&#x3002;&#x4F46;&#x533A;&#x5206;&#x8FD9;&#x4E24;&#x8005;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x9700;&#x8981;&#x52A0;&#x4EE5;&#x533A;&#x5206;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x5F15;&#x5165;&#x7EBF;&#x7A0B;&#x3002;</p>
<p>&#x8FDB;&#x7A0B;&#x662F;&#x7528;&#x4E8E;&#x7EC4;&#x7EC7;&#x8D44;&#x6E90;&#x7684;&#x5355;&#x4F4D;&#xFF0C;&#x8FDB;&#x7A0B;&#x5C06;&#x76F8;&#x5173;&#x7684;&#x8D44;&#x6E90;&#x7EC4;&#x7EC7;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x8FD9;&#x4E9B;&#x8D44;&#x6E90;&#x5305;&#x62EC;&#xFF1A;&#x5185;&#x5B58;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF0C;&#x7A0B;&#x5E8F;&#xFF0C;&#x6570;&#x636E;&#x7B49;&#xFF0C;&#x5C06;&#x8FD9;&#x4E9B;&#x4EE5;&#x8FDB;&#x7A0B;&#x7684;&#x5F62;&#x5F0F;&#x7EC4;&#x7EC7;&#x8D77;&#x6765;&#x53EF;&#x4EE5;&#x4F7F;&#x5F97;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x8FD9;&#x4E9B;&#x8D44;&#x6E90;&#x66F4;&#x4E3A;&#x5BB9;&#x6613;&#x3002;</p>
<p>&#x800C;&#x7EBF;&#x7A0B;&#xFF0C;&#x662F;&#x6BCF;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#x7684;&#x4E00;&#x4E2A;&#x6761;&#x7EBF;&#x3002;&#x7EBF;&#x7A0B;&#x867D;&#x7136;&#x5171;&#x4EAB;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x5927;&#x591A;&#x6570;&#x8D44;&#x6E90;&#xFF0C;&#x4F46;&#x7EBF;&#x7A0B;&#x4E5F;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x4E9B;&#x8D44;&#x6E90;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x7528;&#x4E8E;&#x6807;&#x8BC6;&#x4E0B;&#x4E00;&#x6761;&#x6267;&#x884C;&#x6307;&#x4EE4;&#x7684;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#xFF0C;&#x4E00;&#x4E9B;&#x5BB9;&#x7EB3;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x4EE5;&#x53CA;&#x7528;&#x4E8E;&#x8868;&#x793A;&#x6267;&#x884C;&#x7684;&#x5386;&#x53F2;&#x7684;&#x6808;&#x3002;</p>
<p>&#x603B;&#x800C;&#x8A00;&#x4E4B;&#xFF1A;<strong>&#x8FDB;&#x7A0B;&#x662F;&#x7EC4;&#x7EC7;&#x8D44;&#x6E90;&#x7684;&#x6700;&#x5C0F;&#x5355;&#x4F4D;&#xFF0C;&#x800C;&#x7EBF;&#x7A0B;&#x662F;&#x5B89;&#x6392;CPU&#x6267;&#x884C;&#x7684;&#x6700;&#x5C0F;&#x5355;&#x4F4D;</strong>&#x3002;
&#x5176;&#x5B9E;&#x5728;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x5E76;&#x884C;&#x548C;&#x5728;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#x5E76;&#x884C;&#x975E;&#x5E38;&#x7C7B;&#x4F3C;&#xFF0C;&#x53EA;&#x662F;&#x7EBF;&#x7A0B;&#x5171;&#x4EAB;&#x7684;&#x662F;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF0C;&#x800C;&#x8FDB;&#x7A0B;&#x5171;&#x4EAB;&#x7684;&#x662F;&#x7269;&#x7406;&#x5185;&#x5B58;&#xFF0C;&#x6253;&#x5370;&#x673A;&#xFF0C;&#x952E;&#x76D8;&#x7B49;&#x8D44;&#x6E90;&#x2026;&#x2026;
&#x6BCF;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x548C;&#x7EBF;&#x7A0B;&#x6240;&#x72EC;&#x81EA;&#x5360;&#x6709;&#x7684;&#x8D44;&#x6E90;&#x5982;&#x8868;1&#x6240;&#x793A;&#x3002;</p>
<p><img src="image/14.png" alt="&#x8FDB;&#x7A0B;&#x4E0E;&#x7EBF;&#x7A0B;&#x7684;&#x533A;&#x522B;.png"></p>
<p>&#x5176;&#x4E2D;&#xFF0C;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x5171;&#x4EAB;&#x8FDB;&#x7A0B;&#x72EC;&#x5360;&#x7684;&#x8D44;&#x6E90;&#x3002;
&#x6211;&#x4EEC;&#x5E38;&#x7528;&#x7684;&#x672F;&#x8BED;&#x201C;&#x591A;&#x7EBF;&#x7A0B;&#x201D;&#x4E00;&#x822C;&#x6307;&#x7684;&#x662F;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x7684;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x3002;&#x5982;&#x56FE;2&#x6240;&#x793A;&#x3002;</p>
<p><img src="image/2.png" alt="&#x56FE;2.&#x6CA1;&#x6709;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#x7CFB;&#x7EDF;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x53EA;&#x80FD;&#x7531;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;">    </p>
<p>&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#x8FDB;&#x7A0B;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x8F6E;&#x6D41;&#x4F7F;&#x7528;CPU&#xFF0C;&#x56E0;&#x6B64;&#x5B9E;&#x9645;&#x4E0A;&#x7EBF;&#x7A0B;&#x5E76;&#x4E0D;&#x662F;&#x5E76;&#x884C;&#x7684;&#xFF0C;&#x4F46;&#x4ECE;&#x5B8F;&#x89C2;&#x4E0A;&#x770B;&#xFF0C;&#x662F;&#x5E76;&#x884C;&#x7684;&#x3002;</p>
<p>&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x521D;&#x59CB;&#x521B;&#x5EFA;&#x65F6;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x3002;&#x8FD9;&#x4E2A;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8C03;&#x7528;&#x7CFB;&#x7EDF;&#x7684;&#x5E93;&#x51FD;&#x6570;&#x53BB;&#x521B;&#x5EFA;&#x5176;&#x5B83;&#x7EBF;&#x7A0B;&#x3002;&#x7EBF;&#x7A0B;&#x521B;&#x5EFA;&#x7684;&#x7EBF;&#x7A0B;&#x5E76;&#x5FC5;&#x987B;&#x8981;&#x4E3A;&#x5176;&#x6307;&#x5B9A;&#x5730;&#x5740;&#xFF0C;&#x56E0;&#x4E3A;&#x65B0;&#x7684;&#x7EBF;&#x7A0B;&#x81EA;&#x52A8;&#x5728;&#x521B;&#x5EFA;&#x5B83;&#x7684;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x5185;&#x5DE5;&#x4F5C;&#x3002;&#x867D;&#x7136;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x4F46;&#x901A;&#x5E38;&#x6765;&#x8BB2;&#xFF0C;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x662F;&#x5E76;&#x5217;&#x7684;&#xFF0C;&#x5E76;&#x4E0D;&#x5B58;&#x5728;&#x5C42;&#x7EA7;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x5F53;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x5B8C;&#x6210;&#x5176;&#x5DE5;&#x4F5C;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8C03;&#x7528;&#x7CFB;&#x7EDF;&#x5E93;&#x51FD;&#x6570;&#x8FDB;&#x884C;&#x9500;&#x6BC1;&#x3002;</p>
<h2 id="&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5B9E;&#x73B0;&#x7EBF;&#x7A0B;&#x7684;&#x51E0;&#x79CD;&#x6A21;&#x5F0F;">&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5B9E;&#x73B0;&#x7EBF;&#x7A0B;&#x7684;&#x51E0;&#x79CD;&#x6A21;&#x5F0F;</h2>
<p>&#x5728;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x5728;&#x7528;&#x6237;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x5728;&#x5185;&#x6838;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4E24;&#x8005;&#x7ED3;&#x5408;&#x5B9E;&#x73B0;&#x3002;</p>
<ul>
<li><p><strong>1&#x3001;&#x7EBF;&#x7A0B;&#x5B9E;&#x73B0;&#x5728;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x4E0B;</strong></p>
<p>&#x5F53;&#x7EBF;&#x7A0B;&#x5728;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x4E0B;&#x5B9E;&#x73B0;&#x65F6;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5BF9;&#x7EBF;&#x7A0B;&#x7684;&#x5B58;&#x5728;&#x4E00;&#x65E0;&#x6240;&#x77E5;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x53EA;&#x80FD;&#x770B;&#x5230;&#x8FDB;&#x7A0B;&#xFF0C;&#x800C;&#x4E0D;&#x80FD;&#x770B;&#x5230;&#x7EBF;&#x7A0B;&#x3002;&#x6240;&#x6709;&#x7684;&#x7EBF;&#x7A0B;&#x90FD;&#x662F;&#x5728;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x5B9E;&#x73B0;&#x3002;&#x5728;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x770B;&#x6765;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x3002;&#x8FC7;&#x53BB;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5927;&#x90E8;&#x5206;&#x662F;&#x8FD9;&#x79CD;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x7684;&#x597D;&#x5904;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x5373;&#x4F7F;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0D;&#x652F;&#x6301;&#x7EBF;&#x7A0B;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5E93;&#x51FD;&#x6570;&#x6765;&#x652F;&#x6301;&#x7EBF;&#x7A0B;&#x3002;
&#x5728;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x90FD;&#x7EF4;&#x62A4;&#x7740;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x8868;&#x6765;&#x8FFD;&#x8E2A;&#x672C;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x7EBF;&#x7A0B;&#xFF0C;&#x8FD9;&#x4E2A;&#x8868;&#x4E2D;&#x5305;&#x542B;&#x8868;1&#x4E2D;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x72EC;&#x5360;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x6BD4;&#x5982;&#x6808;&#xFF0C;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x72B6;&#x6001;&#x7B49;&#xFF0C;&#x5982;&#x56FE;3&#x6240;&#x793A;&#x3002;</p>
</li>
</ul>
<p><img src="image/3.png" alt="&#x56FE;3.&#x5728;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x4E2D;&#x5B9E;&#x73B0;&#x7EBF;&#x7A0B;"></p>
<p>&#x200B;        &#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x5F53;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5B8C;&#x6210;&#x4E86;&#x5176;&#x5DE5;&#x4F5C;&#x6216;&#x7B49;&#x5F85;&#x9700;&#x8981;&#x88AB;&#x963B;&#x585E;&#x65F6;&#xFF0C;&#x5176;&#x8C03;&#x7528;&#x7CFB;&#x7EDF;&#x8FC7;&#x7A0B;&#x963B;&#x585E;&#x81EA;&#x8EAB;&#xFF0C;&#x7136;&#x540E;&#x5C06;CPU&#x4EA4;&#x7531;&#x5176;&#x5B83;&#x7EBF;&#x7A0B;&#x3002;
&#x200B;        &#x8FD9;&#x79CD;&#x7684;&#x6A21;&#x5F0F;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x9996;&#x5148;&#xFF0C;&#x662F;&#x5728;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x4E0B;&#x8FDB;&#x884C;&#x8FDB;&#x7A0B;&#x5207;&#x6362;&#x7684;&#x901F;&#x5EA6;&#x8981;&#x8FDC;&#x5FEB;&#x4E8E;&#x5728;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5185;&#x6838;&#x4E2D;&#x5B9E;&#x73B0;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x5728;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x4E0B;&#x5B9E;&#x73B0;&#x7EBF;&#x7A0B;&#x4F7F;&#x5F97;&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x81EA;&#x5DF1;&#x7684;&#x7EBF;&#x7A0B;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#x3002;&#x6BD4;&#x5982;&#x8FDB;&#x7A0B;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x6765;&#x56DE;&#x6536;&#x7EBF;&#x7A0B;&#x3002;&#x8FD8;&#x6709;&#xFF0C;&#x5F53;&#x7EBF;&#x7A0B;&#x6570;&#x91CF;&#x8FC7;&#x591A;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;&#x5728;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x7EF4;&#x62A4;&#x7EBF;&#x7A0B;&#x8868;&#xFF0C;&#x4E0D;&#x4F1A;&#x5360;&#x7528;&#x5927;&#x91CF;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7A7A;&#x95F4;&#x3002;
&#x6709;&#x597D;&#x5904;&#x5C31;&#x6709;&#x574F;&#x5904;&#xFF0C;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x6700;&#x81F4;&#x547D;&#x7684;&#x7F3A;&#x70B9;&#x4E5F;&#x662F;&#x7531;&#x4E8E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0D;&#x77E5;&#x9053;&#x7EBF;&#x7A0B;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x56E0;&#x6B64;&#x5F53;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x67D0;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x8FDB;&#x884C;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x6BD4;&#x5982;&#x7F3A;&#x9875;&#x4E2D;&#x65AD;&#x800C;&#x5BFC;&#x81F4;&#x7EBF;&#x7A0B;&#x963B;&#x585E;&#xFF0C;&#x6B64;&#x65F6;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4F1A;&#x963B;&#x585E;&#x6574;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF0C;&#x5373;&#x4F7F;&#x8FD9;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x5176;&#x5B83;&#x7EBF;&#x7A0B;&#x8FD8;&#x5728;&#x5DE5;&#x4F5C;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x5047;&#x5982;&#x8FDB;&#x7A0B;&#x4E2D;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x957F;&#x65F6;&#x95F4;&#x4E0D;&#x91CA;&#x653E;CPU&#xFF0C;&#x56E0;&#x4E3A;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x5E76;&#x6CA1;&#x6709;&#x65F6;&#x949F;&#x4E2D;&#x65AD;&#x673A;&#x5236;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x6B64;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x5176;&#x5B83;&#x7EBF;&#x7A0B;&#x5F97;&#x4E0D;&#x5230;CPU&#x800C;&#x6301;&#x7EED;&#x7B49;&#x5F85;&#x3002;</p>
<ul>
<li><strong>2&#x3001;&#x7EBF;&#x7A0B;&#x5B9E;&#x73B0;&#x5728;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5185;&#x6838;&#x4E2D;</strong>
&#x5728;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x77E5;&#x9053;&#x7EBF;&#x7A0B;&#x7684;&#x5B58;&#x5728;&#x3002;&#x6B64;&#x65F6;&#x7EBF;&#x7A0B;&#x8868;&#x5B58;&#x5728;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5185;&#x6838;&#x4E2D;&#xFF0C;&#x5982;&#x56FE;4&#x6240;&#x793A;&#x3002;</li>
</ul>
<p><img src="image/4.png" alt="&#x56FE;4.&#x7EBF;&#x7A0B;&#x5728;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5185;&#x6838;&#x4E2D;&#x5B9E;&#x73B0;"></p>
<p>&#x200B;        &#x5728;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x963B;&#x585E;&#x7EBF;&#x7A0B;&#x7684;&#x8C03;&#x7528;&#x90FD;&#x4EE5;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;(System Call)&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#xFF0C;&#x76F8;&#x6BD4;&#x5728;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x4E0B;&#x5B9E;&#x73B0;&#x7EBF;&#x7A0B;&#x9020;&#x6210;&#x963B;&#x585E;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x8C03;&#x7528;(System runtime call)&#x6210;&#x672C;&#x4F1A;&#x9AD8;&#x51FA;&#x5F88;&#x591A;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x963B;&#x585E;&#x65F6;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x5C06;CPU&#x4EA4;&#x7ED9;&#x540C;&#x4E00;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x5176;&#x5B83;&#x7EBF;&#x7A0B;&#xFF0C;&#x6216;&#x662F;&#x5176;&#x5B83;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x7EBF;&#x7A0B;&#xFF0C;&#x800C;&#x5728;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x4E0B;&#x5B9E;&#x73B0;&#x7EBF;&#x7A0B;&#x65F6;&#xFF0C;&#x8C03;&#x5EA6;&#x53EA;&#x80FD;&#x5728;&#x672C;&#x8FDB;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#xFF0C;&#x76F4;&#x5230;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5265;&#x593A;&#x4E86;&#x5F53;&#x524D;&#x8FDB;&#x7A0B;&#x7684;CPU&#x3002;
&#x200B;        &#x56E0;&#x4E3A;&#x5728;&#x5185;&#x6838;&#x6A21;&#x5F0F;&#x4E0B;&#x5B9E;&#x73B0;&#x8FDB;&#x7A0B;&#x7684;&#x6210;&#x672C;&#x66F4;&#x9AD8;&#xFF0C;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x505A;&#x6CD5;&#x662F;&#x53E6;&#x7EBF;&#x7A0B;&#x56DE;&#x6536;&#x5229;&#x7528;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x9700;&#x8981;&#x88AB;&#x9500;&#x6BC1;&#x65F6;&#xFF0C;&#x4EC5;&#x4EC5;&#x662F;&#x4FEE;&#x6539;&#x6807;&#x8BB0;&#x4F4D;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x9500;&#x6BC1;&#x5176;&#x5185;&#x5BB9;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x7EBF;&#x7A0B;&#x9700;&#x8981;&#x88AB;&#x521B;&#x5EFA;&#x65F6;&#xFF0C;&#x4E5F;&#x540C;&#x6837;&#x4FEE;&#x6539;&#x88AB;&#x201C;&#x9500;&#x6BC1;&#x201D;&#x7684;&#x7EBF;&#x7A0B;&#x5176;&#x6807;&#x8BB0;&#x4F4D;&#x5373;&#x53EF;&#x3002;
&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x4E0B;&#x540C;&#x6837;&#x8FD8;&#x662F;&#x6709;&#x4E00;&#x4E9B;&#x5F0A;&#x7AEF;&#xFF0C;&#x6BD4;&#x5982;&#x63A5;&#x6536;&#x7CFB;&#x7EDF;&#x4FE1;&#x53F7;&#x7684;&#x5355;&#x4F4D;&#x662F;&#x8FDB;&#x7A0B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7EBF;&#x7A0B;&#xFF0C;&#x90A3;&#x4E48;&#x7531;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x54EA;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x63A5;&#x6536;&#x7CFB;&#x7EDF;&#x4FE1;&#x53F7;&#x5462;&#xFF1F;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x4E86;&#x8868;&#x6765;&#x8BB0;&#x5F55;&#xFF0C;&#x90A3;&#x4E48;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x6CE8;&#x518C;&#x5219;&#x901A;&#x8FC7;&#x54EA;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5904;&#x7406;&#x7CFB;&#x7EDF;&#x4FE1;&#x53F7;&#xFF1F;</p>
<ul>
<li><strong>3&#x3001;&#x6DF7;&#x5408;&#x6A21;&#x5F0F;</strong>
&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x662F;&#x5C06;&#x4E0A;&#x9762;&#x4E24;&#x79CD;&#x6A21;&#x5F0F;&#x8FDB;&#x884C;&#x6DF7;&#x5408;&#xFF0C;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x4E2D;&#x8FDB;&#x7A0B;&#x7BA1;&#x7406;&#x81EA;&#x5DF1;&#x7684;&#x7EBF;&#x7A0B;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5185;&#x6838;&#x4E2D;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x5185;&#x6838;&#x7EA7;&#x522B;&#x7684;&#x7EBF;&#x7A0B;&#xFF0C;&#x5982;&#x56FE;5&#x6240;&#x793A;&#x3002;</li>
</ul>
<p><img src="image/5.png" alt="&#x56FE;5.&#x6DF7;&#x5408;&#x6A21;&#x5F0F;"></p>
<p>  &#x5728;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x53EA;&#x80FD;&#x770B;&#x5230;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x3002;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x7EBF;&#x7A0B;&#x57FA;&#x4E8E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7EBF;&#x7A0B;&#x8FD0;&#x884C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x4EE5;&#x51B3;&#x5B9A;&#x4F7F;&#x7528;&#x591A;&#x5C11;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x7EBF;&#x7A0B;&#x4EE5;&#x53CA;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7EBF;&#x7A0B;&#xFF0C;&#x8FD9;&#x65E0;&#x7591;&#x5177;&#x6709;&#x66F4;&#x5927;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x3002;&#x800C;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x7EBF;&#x7A0B;&#x7684;&#x8C03;&#x5EA6;&#x548C;&#x524D;&#x9762;&#x6240;&#x8BF4;&#x7684;&#x5728;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x4E0B;&#x6267;&#x884C;&#x5B9E;&#x73B0;&#x7EBF;&#x7A0B;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x81EA;&#x5B9A;&#x4E49;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x539F;&#x6587;&#xFF1A;<a href="http://www.cnblogs.com/CareySon/archive/2012/05/04/ProcessAndThread.html" target="_blank">http://www.cnblogs.com/CareySon/archive/2012/05/04/ProcessAndThread.html</a></p>
<p><a href="https://www.jianshu.com/p/4b1d77054b35" target="_blank">iOS &#x591A;&#x7EBF;&#x7A0B;:&#x300E;<em>NSOperation</em>&#x3001;<em>NSOperation</em>Queue&#x300F;&#x8BE6;&#x5C3D;&#x603B;&#x7ED3; - &#x7B80;&#x4E66;</a></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="iOS多线程开发－多线程实现方式.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 多线程实现方式">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"线程原理","level":"1.3.1","depth":2,"next":{"title":"多线程实现方式","level":"1.3.2","depth":2,"path":"multithreading/iOS多线程开发－多线程实现方式.md","ref":"multithreading/iOS多线程开发－多线程实现方式.md","articles":[]},"previous":{"title":"多线程开发","level":"1.3","depth":1,"ref":"","articles":[{"title":"线程原理","level":"1.3.1","depth":2,"path":"multithreading/iOS多线程开发－线程原理.md","ref":"multithreading/iOS多线程开发－线程原理.md","articles":[]},{"title":"多线程实现方式","level":"1.3.2","depth":2,"path":"multithreading/iOS多线程开发－多线程实现方式.md","ref":"multithreading/iOS多线程开发－多线程实现方式.md","articles":[]},{"title":"线程安全","level":"1.3.3","depth":2,"path":"multithreading/iOS多线程开发－线程安全.md","ref":"multithreading/iOS多线程开发－线程安全.md","articles":[]},{"title":"RunLoop","level":"1.3.4","depth":2,"path":"multithreading/iOS多线程开发－RunLoop.md","ref":"multithreading/iOS多线程开发－RunLoop.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"zhoumin","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"知识小集","language":"zh-hans","links":{"sidebar":{"GitHub主页":"https://github.com/z251257144"},"gitbook":true},"gitbook":"*","description":"知识小集收录我的学习经历和工作经历..."},"file":{"path":"multithreading/iOS多线程开发－线程原理.md","mtime":"2020-12-09T06:37:42.792Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-12-09T06:38:25.877Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

